Ran Plan for dir: `environments/devops/ec2` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_instance.ec2 will be created
+ resource "aws_instance" "ec2" {
      + ami                                  = "ami-0378d599de8ef5653"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t4g.small"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "sergei-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-06f5c306ee75b9950"
      + tags                                 = {
          + "Name" = "test ec2 instance"
        }
      + tags_all                             = {
          + "Environment"     = "devops-tools"
          + "Name"            = "test ec2 instance"
          + "Terraform"       = "Managed"
          + "Terraform-state" = "ec2"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-0cb233d513a475ffd",
        ]

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 20
          + volume_type           = "gp3"
        }
    }

  # module.test-ec2-security-groups.aws_vpc_security_group_egress_rule.egress_rules["test-ec2.egress.allow_all_outbound"] will be created
+ resource "aws_vpc_security_group_egress_rule" "egress_rules" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow all outbound"
      + from_port              = -1
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = "sg-0cb233d513a475ffd"
      + security_group_rule_id = (known after apply)
      + tags_all               = {
          + "Environment"     = "devops-tools"
          + "Terraform"       = "Managed"
          + "Terraform-state" = "ec2"
        }
      + to_port                = -1
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ ec2_ips = {
      + private_ip = (known after apply)
      + public_ip  = (known after apply)
    }
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d environments/devops/ec2
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http:/lock?id=sarhipov%252Fatlantis%252Fenvironments%252Fdevops%252Fec2%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d environments/devops/ec2
  ```
Plan: 2 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```